{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8b5524d7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(rdflib.term.URIRef('http://www.w3.org/ns/sosa/Result'),)\n",
      "(rdflib.term.URIRef('https://smartcity.linkeddata.es/lcc/ontology/urban-sensors#MicroclimateObservation'),)\n",
      "(rdflib.term.URIRef('http://schema.org/Country'),)\n",
      "(rdflib.term.URIRef('https://smartcity.linkeddata.es/lcc/ontology/urban-sensors#Location'),)\n",
      "(rdflib.term.URIRef('http://schema.org/Text'),)\n",
      "(rdflib.term.URIRef('http://schema.org/PostalAddress'),)\n",
      "(rdflib.term.URIRef('https://smartcity.linkeddata.es/lcc/ontology/urban-sensors#MicroclimateSensor'),)\n",
      "(rdflib.term.URIRef('http://schema.org/City'),)\n"
     ]
    }
   ],
   "source": [
    "from rdflib import Graph\n",
    "\n",
    "g = Graph()\n",
    "g.parse(\"microclimate-sensors-data-enriched-updated-with-links.ttl\", format=\"ttl\")\n",
    "\n",
    "q = \"\"\"\n",
    "PREFIX sosa: <http://www.w3.org/ns/sosa/>\n",
    "PREFIX schema: <http://schema.org/>\n",
    "PREFIX us: <https://smartcity.linkeddata.es/lcc/ontology/urban-sensors#>\n",
    "PREFIX wgs84_pos: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "\n",
    "SELECT DISTINCT ?class\n",
    "WHERE {\n",
    "  ?s a ?class .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "results = g.query(q)\n",
    "for row in results:\n",
    "    print(row)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "12114ddc",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Graph identifier=N17a0f614e9a1428fa3568e7a79b8c921 (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from rdflib import Graph\n",
    "\n",
    "g = Graph()\n",
    "g.parse(\"microclimate-sensors-data-enriched-updated-with-links.ttl\", format=\"ttl\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3248cea9",
   "metadata": {},
   "outputs": [],
   "source": [
    "from rdflib import Graph\n",
    "\n",
    "g = Graph()\n",
    "g.parse(\"pedestrian_counts_triplets.ttl\", format=\"ttl\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "b53b110d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(rdflib.term.URIRef('https://smartcity.linkeddata.es/lcc/resource/location/M08'), rdflib.term.Literal('-37.8184515', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('144.9678474', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('Flinders Street 207-361'))\n",
      "(rdflib.term.URIRef('https://smartcity.linkeddata.es/lcc/resource/location/M05'), rdflib.term.Literal('-37.8204083', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('144.9591192', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('Flinders Street 483'))\n",
      "(rdflib.term.URIRef('https://smartcity.linkeddata.es/lcc/resource/location/M01'), rdflib.term.Literal('-37.7956167', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('144.9519007', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('Gatehouse St/Royal Pde (Parkville) 29'))\n",
      "(rdflib.term.URIRef('https://smartcity.linkeddata.es/lcc/resource/location/M10'), rdflib.term.Literal('-37.8128595', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('144.9745395', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('Treasury Place 1'))\n",
      "(rdflib.term.URIRef('https://smartcity.linkeddata.es/lcc/resource/location/M03'), rdflib.term.Literal('-37.8140348', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('144.96728', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('Central Hall, Little Collins Street 210'))\n"
     ]
    }
   ],
   "source": [
    "q = \"\"\"\n",
    "PREFIX sosa: <http://www.w3.org/ns/sosa/>\n",
    "PREFIX schema: <http://schema.org/>\n",
    "PREFIX us: <https://smartcity.linkeddata.es/lcc/ontology/urban-sensors#>\n",
    "PREFIX wgs84_pos: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "\n",
    "SELECT ?loc ?lat ?long ?address\n",
    "WHERE {\n",
    "  ?loc a us:Location ;\n",
    "       wgs84_pos:lat ?lat ;\n",
    "       wgs84_pos:long ?long ;\n",
    "       schema:streetAddress ?address .\n",
    "}\n",
    "LIMIT 5\n",
    "\"\"\"\n",
    "\n",
    "results = g.query(q)\n",
    "for row in results:\n",
    "    print(row)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "7046d91b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(rdflib.term.URIRef('https://smartcity.linkeddata.es/lcc/resource/location/M08'), rdflib.term.Literal('-37.8184515', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('144.9678474', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('Flinders Street'), rdflib.term.URIRef('http://www.wikidata.org/entity/Q3442521'), rdflib.term.Literal('Melbourne'), rdflib.term.URIRef('http://www.wikidata.org/entity/Q3141'))\n",
      "(rdflib.term.URIRef('https://smartcity.linkeddata.es/lcc/resource/location/M05'), rdflib.term.Literal('-37.8204083', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('144.9591192', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('Flinders Street'), rdflib.term.URIRef('http://www.wikidata.org/entity/Q3442521'), rdflib.term.Literal('Melbourne'), rdflib.term.URIRef('http://www.wikidata.org/entity/Q3141'))\n",
      "(rdflib.term.URIRef('https://smartcity.linkeddata.es/lcc/resource/location/M01'), rdflib.term.Literal('-37.7956167', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('144.9519007', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('Gatehouse St/Royal Pde (Parkville)'), rdflib.term.URIRef('http://www.wikidata.org/entity/Q112824421'), rdflib.term.Literal('Parkville'), rdflib.term.URIRef('http://www.wikidata.org/entity/Q3427921'))\n",
      "(rdflib.term.URIRef('https://smartcity.linkeddata.es/lcc/resource/location/M03'), rdflib.term.Literal('-37.8140348', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('144.96728', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('Central Hall, Little Collins Street'), rdflib.term.URIRef('http://www.wikidata.org/entity/Q114636721'), rdflib.term.Literal('Melbourne'), rdflib.term.URIRef('http://www.wikidata.org/entity/Q3141'))\n",
      "(rdflib.term.URIRef('https://smartcity.linkeddata.es/lcc/resource/location/M07'), rdflib.term.Literal('-37.8222341', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('144.9829409', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#float')), rdflib.term.Literal('Olympic Boulevard'), rdflib.term.URIRef('http://www.wikidata.org/entity/Q136004235'), rdflib.term.Literal('Melbourne'), rdflib.term.URIRef('http://www.wikidata.org/entity/Q3141'))\n"
     ]
    }
   ],
   "source": [
    "q = \"\"\"\n",
    "PREFIX sosa: <http://www.w3.org/ns/sosa/>\n",
    "PREFIX schema: <http://schema.org/>\n",
    "PREFIX us: <https://smartcity.linkeddata.es/lcc/ontology/urban-sensors#>\n",
    "PREFIX wgs84_pos: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "\n",
    "SELECT ?location ?lat ?long ?streetName ?wikidataStreet ?cityName ?wikidataCity\n",
    "WHERE {\n",
    "    # Localización y coordenadas\n",
    "    ?location a us:Location ;\n",
    "              wgs84_pos:lat ?lat ;\n",
    "              wgs84_pos:long ?long ;\n",
    "              # Enlace a la entidad calle\n",
    "              us:hasStreet ?streetEntity ;\n",
    "              # Enlace a la entidad ciudad\n",
    "              us:inAdministrativeArea ?cityEntity .\n",
    "\n",
    "    # Detalles de la calle y su enlace Wikidata\n",
    "    ?streetEntity a schema:PostalAddress ;\n",
    "                  schema:streetAddress ?streetName ;\n",
    "                  owl:sameAs ?wikidataStreet .\n",
    "\n",
    "    # Detalles de la ciudad y su enlace Wikidata\n",
    "    ?cityEntity a schema:City ; # O schema:AdministrativeArea si es más general\n",
    "                rdfs:label ?cityName ;\n",
    "                owl:sameAs ?wikidataCity .\n",
    "\n",
    "}\n",
    "LIMIT 5 # Reducido el límite para que la salida sea más manejable\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "results = g.query(q)\n",
    "for row in results:\n",
    "    print(row)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "a9570ef3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(rdflib.term.Literal('FliS_T'), rdflib.term.Literal('306', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('925', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('619', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('2024-12-02T22:00:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.Literal('FliS_T'), rdflib.term.Literal('727', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('1364', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('637', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('2024-12-02T19:00:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.Literal('FliS_T'), rdflib.term.Literal('815', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('1878', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('1063', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('2024-12-02T18:00:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.Literal('FliS_T'), rdflib.term.Literal('1098', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('3390', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('2292', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('2024-12-02T17:00:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.Literal('FliS_T'), rdflib.term.Literal('802', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('1623', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('821', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('2024-12-02T12:00:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.Literal('FliS_T'), rdflib.term.Literal('579', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('1212', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('633', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('2024-12-02T11:00:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.Literal('FliS_T'), rdflib.term.Literal('807', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('1298', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('491', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('2024-12-02T09:00:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.Literal('FliS_T'), rdflib.term.Literal('1982', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('2836', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('854', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('2024-12-02T08:00:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.Literal('FliS_T'), rdflib.term.Literal('731', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('1186', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('455', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('2024-12-02T07:00:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.Literal('FliS_T'), rdflib.term.Literal('267', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('478', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('211', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('2024-12-02T06:00:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.Literal('FliS_T'), rdflib.term.Literal('87', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('182', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('95', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('2024-12-02T05:00:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.Literal('FliS_T'), rdflib.term.Literal('10', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('40', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('30', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('2024-12-02T04:00:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.Literal('FliS_T'), rdflib.term.Literal('9', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('14', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('5', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('2024-12-02T03:00:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.Literal('FliS_T'), rdflib.term.Literal('21', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('46', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('25', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('2024-12-02T02:00:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.Literal('FliS_T'), rdflib.term.Literal('38', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('85', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('47', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('2024-12-02T01:00:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.Literal('FliS_T'), rdflib.term.Literal('51', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('166', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('115', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')), rdflib.term.Literal('2024-12-02T00:00:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n"
     ]
    }
   ],
   "source": [
    "q = \"\"\"\n",
    "PREFIX sosa: <http://www.w3.org/ns/sosa/>\n",
    "PREFIX us: <https://smartcity.linkeddata.es/lcc/ontology/urban-sensors#>\n",
    "\n",
    "SELECT ?sensor ?count ?dir1 ?dir2 ?time\n",
    "WHERE {\n",
    "  ?observation a us:PedestrianObservation ;\n",
    "               sosa:resultTime ?time ;\n",
    "               sosa:madeBySensor ?sensor ;\n",
    "               us:pedestrianCount ?dir1 ;\n",
    "               us:pedestrianCountD1 ?dir2 ;\n",
    "               us:pedestrianCountD2 ?count .\n",
    "\n",
    "  FILTER (STRSTARTS(STR(?time), \"2024-12-02\") && ?sensor = \"FliS_T\")\n",
    "}\n",
    "ORDER BY DESC(?time)\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "results = g.query(q)\n",
    "for row in results:\n",
    "    print(row)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "80952449",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
