{
  "cells": [
    {
      "cell_type": "code",
      "execution_count": 447,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "8VxIOIgcdUpO",
        "outputId": "6d8cf908-c838-44e6-c97c-3af98bcddd59"
      },
      "outputs": [],
      "source": [
        "# !pip install rdflib\n",
        "# !pip install morph-kgc\n",
        "# !pip install owlrl\n",
        "# !pip install sqlalchemy"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 448,
      "metadata": {},
      "outputs": [
        {
          "name": "stderr",
          "output_type": "stream",
          "text": [
            "INFO | 2025-11-12 17:30:42,439 | Parallelization is not supported for win32 when running as a library. If you need to speed up your data integration pipeline, please run through the command line.\n",
            "INFO | 2025-11-12 17:30:43,297 | 36 mapping rules retrieved.\n",
            "INFO | 2025-11-12 17:30:43,336 | Mapping partition with 34 groups generated.\n",
            "INFO | 2025-11-12 17:30:43,341 | Maximum number of rules within mapping group: 3.\n",
            "INFO | 2025-11-12 17:30:43,341 | Mappings processed in 0.758 seconds.\n",
            "INFO | 2025-11-12 17:30:43,830 | Number of triples generated in total: 8080.\n"
          ]
        },
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "Archivo resultado.nt generado\n"
          ]
        },
        {
          "name": "stderr",
          "output_type": "stream",
          "text": [
            "c:\\Users\\julia\\AppData\\Local\\Programs\\Python\\Python312\\Lib\\site-packages\\rdflib\\plugins\\serializers\\nt.py:41: UserWarning: NTSerializer always uses UTF-8 encoding. Given encoding was: None\n",
            "  warnings.warn(\n"
          ]
        }
      ],
      "source": [
        "import morph_kgc\n",
        "g = morph_kgc.materialize('../mappings/config.ini')\n",
        "\n",
        "g.serialize(destination='resultado.nt', format='nt')\n",
        "print(\"Archivo resultado.nt generado\")"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 449,
      "metadata": {},
      "outputs": [
        {
          "data": {
            "text/plain": [
              "<Graph identifier=Nca307fa3050c4389a459473fd15bad2e (<class 'rdflib.graph.Graph'>)>"
            ]
          },
          "execution_count": 449,
          "metadata": {},
          "output_type": "execute_result"
        }
      ],
      "source": [
        "from rdflib import Graph\n",
        "from owlrl import DeductiveClosure, RDFS_Semantics\n",
        "\n",
        "g = Graph()\n",
        "\n",
        "g.parse(\"../ontology/ontology.ttl\", format=\"turtle\")\n",
        "g.parse(\"resultado.nt\", format=\"nt\")\n",
        "\n",
        "# DeductiveClosure(RDFS_Semantics).expand(g)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 450,
      "metadata": {},
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "Triples cargados: 8221\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/EducationalInstitution/Universidad-Complutense-de-Madrid.-Facultad-de-Filologia https://schema.org/postalCode 28040\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/EducationalInstitution/Colegio-Universitario-de-Estudios-Financieros https://schema.org/name Colegio Universitario de Estudios Financieros\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/SportsFacility/Centro-Deportivo-Municipal-La-Cebada-%28antigua-La-Latina%29 http://www.w3.org/2003/01/geo/wgs84_pos#lat 40.410546084176566\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Park/Parque-de-la-Amistad http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://smartcity.linkeddata.es/lcc/ontology#Facility\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Park/Parque-Eva-Duarte http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://smartcity.linkeddata.es/lcc/ontology#Facility\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/SportsFacility/Centro-Deportivo-Municipal-Hortaleza http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://smartcity.linkeddata.es/lcc/ontology#SportsFacility\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/SportsFacility/Centro-Deportivo-Municipal-Ciudad-de-los-Poetas http://smartcity.linkeddata.es/lcc/ontology#accessibility No accesible\n",
            "http://smartcity.linkeddata.es/lcc/resource/subway/Metro%3A%20Canillejas%2C%20Torre%20Arias%20%28l%C3%ADnea%205%29 http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://smartcity.linkeddata.es/lcc/ontology#Subway\n",
            "http://smartcity.linkeddata.es/lcc/resource/bus/Bus%3A%20104%2C%2077%2C%20140%2C%20153 http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://smartcity.linkeddata.es/lcc/ontology#Bus\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/EducationalInstitution/Colegio-Mayor-Barberan-y-Collar https://schema.org/email cmubarberan@mde.es\n",
            "http://smartcity.linkeddata.es/lcc/resource/bus/Bus%3A18%2C%2062 http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://smartcity.linkeddata.es/lcc/ontology#Bus\n",
            "http://smartcity.linkeddata.es/lcc/resource/bus/Bus%3A%2034 http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://smartcity.linkeddata.es/lcc/ontology#Bus\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Park/Jardin-del-Maestro-Padilla http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://smartcity.linkeddata.es/lcc/ontology#Facility\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/EducationalInstitution/Escuela-Tecnica-Superior-de-Ingenieros-Industriales http://www.w3.org/2003/01/geo/wgs84_pos#lat 40.44042600324054\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/EducationalInstitution/Universidad-Complutense-de-Madrid.-Facultad-de-Bellas-Artes https://schema.org/containedInPlace http://smartcity.linkeddata.es/lcc/resource/neighbourhood/CIUDAD%20UNIVERSITARIA\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/EducationalInstitution/Universidad-Autonoma-de-Madrid.-Facultad-de-Formacion-de-Profesorado-y-Educacion http://www.w3.org/2003/01/geo/wgs84_pos#long -3.697774510862534\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Library/Biblioteca-Publica-Municipal-Francisco-Ibanez-%28Chamartin%29 https://schema.org/containedInPlace http://smartcity.linkeddata.es/lcc/resource/neighbourhood/CIUDAD%20JARDIN\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Park/Jardines-de-la-Basilica http://smartcity.linkeddata.es/lcc/ontology#hasNearby http://smartcity.linkeddata.es/lcc/resource/train/Renfe%3A%20Nuevos%20Ministerios%20%28l%C3%ADneas%20C1%2C%20C3%2C%20C4%2C%20C7%2C%20C8%2C%20C10%29\n",
            "http://smartcity.linkeddata.es/lcc/resource/subway/Metro%3A%20Canillejas%2C%20Torre%20Arias%20%28l%C3%ADnea%205%29 http://smartcity.linkeddata.es/lcc/ontology#hasStations Canillejas, Torre Arias\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Library/Biblioteca-Publica-del-Estado-Manuel-Alvar-%28Salamanca%29 https://schema.org/postalCode 28028\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Library/Biblioteca-Publica-Municipal-Portazgo-%28Puente-de-Vallecas%29 https://schema.org/name Biblioteca Pública Municipal Portazgo (Puente de Vallecas)\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/SportsFacility/Centro-Deportivo-Municipal-Fabian-Roncero https://schema.org/addressRegion MADRID\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/EducationalInstitution/Universidad-Complutense-de-Madrid.-Facultad-de-Medicina https://schema.org/addressRegion MADRID\n",
            "http://smartcity.linkeddata.es/lcc/resource/subway/Metro%3A%20P%C3%ADo%20XII http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://smartcity.linkeddata.es/lcc/ontology#Subway\n",
            "http://smartcity.linkeddata.es/lcc/resource/bus/Bus%3A%20E3%20%2C%204%20%2C%20100%20%2C%20106%20%2C%20130 http://smartcity.linkeddata.es/lcc/ontology#hasLines 3\n",
            "4\n",
            "100\n",
            "106\n",
            "130\n",
            "http://smartcity.linkeddata.es/lcc/resource/bus/Bus%3A%2010%2C%2014%2C%2032%2C%2056%2C%2063%2C%20143%2C%20145%2C%20E http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://smartcity.linkeddata.es/lcc/ontology#Bus\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/EducationalInstitution/Colegio-Mayor-Nuestra-Senora-de-Guadalupe https://schema.org/addressRegion MADRID\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Park/Parque-Urpisa https://schema.org/addressRegion MADRID\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/EducationalInstitution/Instituto-de-Estudios-Bursatiles https://schema.org/name Instituto de Estudios Bursátiles\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Park/Parque-Nudo-Norte-de-Begona https://schema.org/containedInPlace http://smartcity.linkeddata.es/lcc/resource/neighbourhood/VALVERDE\n",
            "http://smartcity.linkeddata.es/lcc/resource/bus/Bus%3A%203%2C%2060%20y%20148 http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://smartcity.linkeddata.es/lcc/ontology#Bus\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/SportsFacility/Centro-Deportivo-Municipal-Lago-Casa-de-Campo https://schema.org/name Centro Deportivo Municipal Lago Casa de Campo\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/EducationalInstitution/Colegio-Mayor-Ximenez-de-Cisneros http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://smartcity.linkeddata.es/lcc/ontology#ResidenceHall\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Park/Parque-de-Juan-XXIII https://schema.org/containedInPlace http://smartcity.linkeddata.es/lcc/resource/neighbourhood/CIUDAD%20UNIVERSITARIA\n",
            "http://smartcity.linkeddata.es/lcc/resource/bus/Bus%3A%203%20%2C%2031%20%2C%2050%20%2C%2065%20%2C%20148 http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://smartcity.linkeddata.es/lcc/ontology#Bus\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Library/Biblioteca-Publica-Pedro-Salinas-%28Centro%29 http://www.w3.org/2003/01/geo/wgs84_pos#long -3.7110439355238602\n",
            "http://smartcity.linkeddata.es/lcc/resource/bus/Bus%3A%2031%20%2C%2041%20%2C%2050%20%2C%2065 http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://smartcity.linkeddata.es/lcc/ontology#Bus\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Park/Parque-de-La-Rinconada http://smartcity.linkeddata.es/lcc/ontology#surface 42739\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Park/Jardin-Dona-Concha-Piquer http://smartcity.linkeddata.es/lcc/ontology#hasSportsFacilities no\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/EducationalInstitution/Universidad-Complutense-de-Madrid.-Facultad-de-Ciencias-Geologicas https://schema.org/containedInPlace http://smartcity.linkeddata.es/lcc/resource/neighbourhood/CIUDAD%20UNIVERSITARIA\n",
            "http://smartcity.linkeddata.es/lcc/resource/bus/Bus%3A%20114%20%2C%20115 http://smartcity.linkeddata.es/lcc/ontology#hasLines 114\n",
            "115\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Park/Parque-Eugenia-de-Montijo http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://smartcity.linkeddata.es/lcc/ontology#Park\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/SportsFacility/Centro-Deportivo-Municipal-Penuelas http://smartcity.linkeddata.es/lcc/ontology#hasNearby http://smartcity.linkeddata.es/lcc/resource/subway/Metro%3A%20Acacias%2C%20Embajadores%2C%20Pir%C3%A1mides\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Park/Parque-Valdebernardo-Este http://smartcity.linkeddata.es/lcc/ontology#hasSportsFacilities sí\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Park/Jardin-de-Embajadores-M-30 http://smartcity.linkeddata.es/lcc/ontology#hasSportsFacilities sí\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Park/Jardines-del-Principe-de-Anglona http://smartcity.linkeddata.es/lcc/ontology#hasNearby http://smartcity.linkeddata.es/lcc/resource/subway/Metro%3A%20La%20Latina%20%28l%C3%ADnea%205%29\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/EducationalInstitution/Colegio-Mayor-Ximenez-de-Cisneros http://smartcity.linkeddata.es/lcc/ontology#studentGender mixto\n",
            "http://smartcity.linkeddata.es/lcc/ontology# http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://www.w3.org/2002/07/owl#Ontology\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/SportsFacility/Centro-Deportivo-Municipal-Blanca-Fernandez-Ochoa-%28La-Mina%29 https://schema.org/streetAddress MONSEÑOR OSCAR ROMERO\n",
            "http://smartcity.linkeddata.es/lcc/resource/subway/Metro%3A%20Vicente%20Aleixandre%20%28l%C3%ADnea%206%29%2C%20Islas%20Filipinas%20%28l%C3%ADnea%207%29 http://smartcity.linkeddata.es/lcc/ontology#hasLines 6\n",
            "7\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/EducationalInstitution/Universidad-Complutense-de-Madrid.-Facultad-de-Estudios-Estadisticos https://schema.org/email pgweb@estad.ucm.es\n",
            "http://smartcity.linkeddata.es/lcc/resource/train/Renfe%3A%20Pir%C3%A1mides%20%28l%C3%ADneas%20C1%20y%20C10%29 http://smartcity.linkeddata.es/lcc/ontology#hasStations Pirámides\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/EducationalInstitution/Colegio-Mayor-Universitario-San-Pablo https://schema.org/streetAddress ISAAC PERAL\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Library/Biblioteca-Publica-Municipal-Pozo-del-Tio-Raimundo-%28Puente-de-Vallecas%29 https://schema.org/containedInPlace http://smartcity.linkeddata.es/lcc/resource/neighbourhood/ENTREVIAS\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/EducationalInstitution/Escuela-Universitaria-de-Enfermeria.-Fundacion-Jimenez-Diaz http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://smartcity.linkeddata.es/lcc/ontology#EducationalInstitution\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Park/Parque-Concejal-Miguel-Martin-Vela http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://smartcity.linkeddata.es/lcc/ontology#Facility\n"
          ]
        }
      ],
      "source": [
        "PREFIXES = \"\"\"\n",
        "PREFIX sc:     <http://smartcity.linkeddata.es/lcc/ontology#> \n",
        "PREFIX schema: <https://schema.org/> \n",
        "PREFIX geo:    <http://www.w3.org/2003/01/geo/wgs84_pos#> \n",
        "PREFIX dbo:    <http://dbpedia.org/ontology/> \n",
        "PREFIX owl:    <http://www.w3.org/2002/07/owl#> \n",
        "PREFIX rdfs:   <http://www.w3.org/2000/01/rdf-schema#> \n",
        "PREFIX xsd:    <http://www.w3.org/2001/XMLSchema#> \n",
        "\"\"\"\n",
        "\n",
        "\n",
        "print(f\"Triples cargados: {len(g)}\")\n",
        "\n",
        "# Mostrar las primeras 10 tripletas\n",
        "for i, (s, p, o) in enumerate(g):\n",
        "    print(s, p, o)\n",
        "    if i >= 55:\n",
        "        break"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 451,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "NqmE7mTae1ND",
        "outputId": "61ea6aaa-ec43-492a-f847-8a8987d8c30c"
      },
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "Triples cargados: 8221\n"
          ]
        }
      ],
      "source": [
        "print(f\"Triples cargados: {len(g)}\")\n",
        "\n",
        "PREFIXES = \"\"\"\n",
        "PREFIX sc:     <http://smartcity.linkeddata.es/lcc/ontology#>\n",
        "PREFIX schema: <https://schema.org/>\n",
        "PREFIX dbo:    <http://dbpedia.org/ontology/>\n",
        "PREFIX geo:    <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
        "\"\"\"\n",
        "\n",
        "def qrun(q, limit=50):\n",
        "    q = PREFIXES + q\n",
        "    res = g.query(q)\n",
        "    print(f\"--- {len(res)} filas ---\")\n",
        "    for i,row in enumerate(res):\n",
        "        print([str(x) if x is not None else None for x in row])\n",
        "        if i >= limit-1: break"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 452,
      "metadata": {},
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "--- 4 filas ---\n",
            "['Educational Institution', '117']\n",
            "['Library', '50']\n",
            "['Park or Garden', '203']\n",
            "['Sport Facility', '81']\n"
          ]
        }
      ],
      "source": [
        "########################################################################################\n",
        "# ✅ Número de individuos de cada subclase de Facility (tabla con tipo y conteo)\n",
        "# - Devuelve una fila por subclase: University, Library, ParkGarden, SportsCenter\n",
        "########################################################################################\n",
        "\n",
        "qrun(\"\"\"\n",
        "SELECT ?type (COUNT(?x) AS ?count) WHERE {\n",
        "  ?x a ?subclass .\n",
        "  ?subclass rdfs:subClassOf sc:Facility .\n",
        "  ?subclass rdfs:label ?type .\n",
        "}\n",
        "GROUP BY ?type\n",
        "ORDER BY ?type\n",
        "\"\"\")\n",
        "\n",
        "\n",
        "# --- 8 filas ---\n",
        "# ['Educational Institution', '117']\n",
        "# ['Faculty', '35']\n",
        "# ['Library', '50']\n",
        "# ['Other Centers', '13']\n",
        "# ['Park or Garden', '203']\n",
        "# ['Residence Hall', '48']\n",
        "# ['Sport Facility', '81']\n",
        "# ['University School', '21']"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 453,
      "metadata": {},
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "--- 4 filas ---\n",
            "['Faculty', '35']\n",
            "['Other Centers', '13']\n",
            "['Residence Hall', '48']\n",
            "['University School', '21']\n"
          ]
        }
      ],
      "source": [
        "qrun(\"\"\"\n",
        "SELECT ?type (COUNT(?x) AS ?count) WHERE {\n",
        "  ?x a ?subclass .\n",
        "  ?subclass rdfs:subClassOf sc:EducationalInstitution .\n",
        "  ?subclass rdfs:label ?type .\n",
        "}\n",
        "GROUP BY ?type\n",
        "ORDER BY ?type\n",
        "\"\"\")\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 454,
      "metadata": {},
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "\n",
            "### EducationalInstitutions\n",
            "--- 5 filas ---\n",
            "['Escuela Técnica Superior de Ingenieros de Caminos, Canales y Puertos. Edificio Retiro']\n",
            "['Escuela Universitaria de Enfermería. Fundación Jiménez Díaz']\n",
            "['Universidad Complutense de Madrid. Facultad de Informática']\n",
            "['Centro de Enseñanza Superior en Humanidades y Ciencias de la Educación Don Bosco']\n",
            "['Residencia Universitaria Tagaste']\n",
            "\n",
            "### PublicLibraries\n",
            "--- 5 filas ---\n",
            "['Biblioteca Pública Municipal Gabriel García Márquez (Usera)']\n",
            "['Biblioteca Pública Municipal Iván de Vargas (Centro)']\n",
            "['Biblioteca Pública Municipal Ángel González (Latina)']\n",
            "['Biblioteca Pública Municipal Ciudad Lineal (Ciudad Lineal)']\n",
            "['Centro Cultural Paco Rabal. Biblioteca Pública (Puente de Vallecas)']\n",
            "\n",
            "### ParksGardens\n",
            "--- 5 filas ---\n",
            "['Parque de Las Cruces']\n",
            "['Parque Eugenia de Montijo']\n",
            "['Parque Mujeres de Orcasitas']\n",
            "['Parque San José de Calasanz']\n",
            "['Jardines de Sabatini']\n",
            "\n",
            "### SportsCenters\n",
            "--- 5 filas ---\n",
            "['Centro Deportivo Municipal Hortaleza']\n",
            "['Centro Deportivo Municipal Cerro Almodóvar']\n",
            "['Centro Deportivo Municipal Fuente del Berro']\n",
            "['Centro Deportivo Municipal Vallecas Verano']\n",
            "['Centro Deportivo Municipal Alfredo Goyeneche']\n"
          ]
        }
      ],
      "source": [
        "########################################################################################\n",
        "# ✅ Número de individuos de cada subclase DIRECTA de Facility, no aparecen subclases de subclases \n",
        "# - Devuelve una fila por subclase: University, Library, ParkGarden, SportsCenter\n",
        "########################################################################################\n",
        "\n",
        "for subtype,label in [\n",
        "    (\"sc:EducationalInstitution\",\"EducationalInstitutions\"),\n",
        "    (\"sc:Library\",\"PublicLibraries\"),\n",
        "    (\"sc:Park\",\"ParksGardens\"),\n",
        "    (\"sc:SportsFacility\",\"SportsCenters\")\n",
        "]:\n",
        "    print(f\"\\n### {label}\")\n",
        "    qrun(f\"\"\"\n",
        "SELECT ?name WHERE {{\n",
        "  ?x a {subtype} .\n",
        "\n",
        "  # Filtrar solo subclases directas de Facility\n",
        "  ?subclass rdfs:subClassOf sc:Facility .\n",
        "  ?x a ?subclass .\n",
        "\n",
        "  OPTIONAL {{ ?x schema:name ?raw }}\n",
        "  BIND(COALESCE(?raw, REPLACE(STR(?x), '^.*/', '')) AS ?name)\n",
        "}}\n",
        "LIMIT 5\n",
        "\"\"\", limit=5)\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 455,
      "metadata": {},
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "--- 3 filas ---\n",
            "['Bus']\n",
            "['Subway']\n",
            "['Train']\n"
          ]
        }
      ],
      "source": [
        "########################################################################################\n",
        "# ✅ Tipos de Public Transport, suclases de public transport: (subwary, train, bus)\n",
        "########################################################################################\n",
        "\n",
        "qrun(\"\"\"\n",
        "SELECT ?type WHERE {\n",
        "  ?x a ?subclass .\n",
        "  ?subclass rdfs:subClassOf sc:PublicTransport .\n",
        "  ?subclass rdfs:label ?type .\n",
        "}\n",
        "GROUP BY ?type\n",
        "ORDER BY ?type\n",
        "\"\"\")"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 456,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "4wyiHJ6SOS1Z",
        "outputId": "97d4d58f-ad91-4018-bb3d-c2e6bcf25bb5"
      },
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "\n",
            "### Metro Stations\n",
            "--- 5 filas ---\n",
            "['Canillejas, Torre Arias']\n",
            "['Pacífico']\n",
            "['Pío XII']\n",
            "['Carabanchel , Eugenia de Montijo']\n",
            "['Villaverde Bajo Cruce']\n",
            "\n",
            "### Train Stations\n",
            "--- 5 filas ---\n",
            "['Orcasitas']\n",
            "['El Pozo']\n",
            "[': Villaverde Bajo']\n",
            "['Embajadores']\n",
            "['Príncipe Pío']\n"
          ]
        }
      ],
      "source": [
        "########################################################################################\n",
        "# ✅ 5 ejemplos de Estaciones de Metro y Tren \n",
        "########################################################################################\n",
        "\n",
        "for ttype, label in [\n",
        "    (\"sc:Subway\", \"Metro Stations\"),  # Cambiamos de SubwayStation a Subway\n",
        "    (\"sc:Train\", \"Train Stations\")  # Cambiamos de TrainStation a Train\n",
        "]:\n",
        "    print(f\"\\n### {label}\")\n",
        "    # Modificamos la consulta para buscar el recurso de transporte (?t)\n",
        "    qrun(f\"\"\"\n",
        "SELECT DISTINCT ?stationName WHERE {{\n",
        "  ?t a {ttype} .        \n",
        "  ?t sc:hasStations ?stationName .\n",
        "}}\n",
        "LIMIT 5\n",
        "\"\"\", limit=5)\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 457,
      "metadata": {},
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "\n",
            "### Metro lines\n",
            "--- 5 filas ---\n",
            "['5']\n",
            "['3']\n",
            "['9']\n",
            "['2']\n",
            "['6']\n",
            "\n",
            "### Train lines\n",
            "--- 5 filas ---\n",
            "['C-5']\n",
            "['C-2\\r\\nC-7\\r\\nC-8']\n",
            "['C-3\\r\\nC-4']\n",
            "['C-1\\r\\nC-7\\r\\nC-10']\n",
            "['C-3\\r\\nC-7\\r\\nC-8']\n",
            "\n",
            "### Bus lines\n",
            "--- 5 filas ---\n",
            "['104\\r\\n77\\r\\n140\\r\\n153']\n",
            "['18\\r\\n62']\n",
            "['34']\n",
            "['10\\r\\n14\\r\\n32\\r\\n56\\r\\n63\\r\\n143\\r\\n145']\n",
            "['3\\r\\n60\\r\\n148']\n"
          ]
        }
      ],
      "source": [
        "########################################################################################\n",
        "# ✅ 5 ejemplos de Lineas de Metro, Tren y bus\n",
        "########################################################################################\n",
        "\n",
        "for ttype, label in [\n",
        "    (\"sc:Subway\", \"Metro lines\"),  \n",
        "    (\"sc:Train\", \"Train lines\"),  \n",
        "    (\"sc:Bus\", \"Bus lines\") \n",
        "]:\n",
        "    print(f\"\\n### {label}\")\n",
        "    qrun(f\"\"\"\n",
        "SELECT DISTINCT ?busLine WHERE {{\n",
        "  ?t a {ttype} .        \n",
        "  ?t sc:hasLines ?busLine .\n",
        "}}\n",
        "LIMIT 5\n",
        "\"\"\", limit=5)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 458,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "Nb4kKH8IOknl",
        "outputId": "b99a6de9-231e-4bf0-c935-82a8507847ac"
      },
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "--- 3 filas ---\n",
            "['District', '22']\n",
            "['Municipality', '1']\n",
            "['Neighbourhood', '118']\n"
          ]
        }
      ],
      "source": [
        "########################################################################################\n",
        "# ✅ Número de Municipios, Distritos y Barrios distintos\n",
        "########################################################################################\n",
        "\n",
        "qrun(\"\"\"\n",
        "SELECT ?type (COUNT(DISTINCT ?entity) AS ?count)\n",
        "WHERE {\n",
        "  { ?entity a dbo:Municipality  BIND(\"Municipality\"  AS ?type) } UNION\n",
        "  { ?entity a dbo:District      BIND(\"District\"      AS ?type) } UNION\n",
        "  { ?entity a dbo:Neighbourhood BIND(\"Neighbourhood\" AS ?type) }\n",
        "}\n",
        "GROUP BY ?type\n",
        "ORDER BY ?type\n",
        "     \n",
        "\"\"\")"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 459,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "OcNePZc-OmLg",
        "outputId": "d6b13284-95cd-43ac-ecc6-41d71900a192"
      },
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "\n",
            "### Municipality\n",
            "--- 1 filas ---\n",
            "['MADRID']\n",
            "\n",
            "### District\n",
            "--- 5 filas ---\n",
            "['TETUAN']\n",
            "['CHAMARTIN']\n",
            "['DISTRITO']\n",
            "['FUENCARRAL-EL PARDO']\n",
            "['CENTRO']\n",
            "\n",
            "### Neighbourhood\n",
            "--- 5 filas ---\n",
            "['CASTILLA']\n",
            "['JUSTICIA']\n",
            "['ALMENDRALES']\n",
            "['MIRASIERRA']\n",
            "['PROSPERIDAD']\n"
          ]
        }
      ],
      "source": [
        "########################################################################################\n",
        "# ✅  5 ejemplos de Municipio, Distrito y Barrio (solo nombre)\n",
        "########################################################################################\n",
        "\n",
        "for ctype,label in [\n",
        "    (\"dbo:Municipality\", \"Municipality\"),\n",
        "    (\"dbo:District\", \"District\"),\n",
        "    (\"dbo:Neighbourhood\", \"Neighbourhood\"),\n",
        "]:\n",
        "    print(f\"\\n### {label}\")\n",
        "    qrun(f\"\"\"\n",
        "SELECT ?name WHERE {{\n",
        "  ?x a {ctype} .\n",
        "  OPTIONAL {{ ?x schema:name ?raw }}\n",
        "  BIND(COALESCE(?raw, REPLACE(STR(?x), '^.*/', '')) AS ?name)\n",
        "}}\n",
        "LIMIT 5\n",
        "\"\"\", limit=5)\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 463,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "Q4w6x0grOpRZ",
        "outputId": "15ebe865-1308-4359-c010-1b44a1adf28d"
      },
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "### Neigbourhood → District\n",
            "--- 119 filas ---\n",
            "['ABRANTES', 'CARABANCHEL']\n",
            "['ACACIAS', 'ARGANZUELA']\n",
            "['ADELFAS', 'RETIRO']\n",
            "['ALAMEDA DE OSUNA', 'BARAJAS']\n",
            "['ALMAGRO', 'CHAMBERI']\n",
            "\n",
            "### District → Municipality\n",
            "--- 22 filas ---\n",
            "['ARGANZUELA', 'MADRID']\n",
            "['BARAJAS', 'MADRID']\n",
            "['CARABANCHEL', 'MADRID']\n",
            "['CENTRO', 'MADRID']\n",
            "['CHAMARTIN', 'MADRID']\n"
          ]
        }
      ],
      "source": [
        "########################################################################################\n",
        "# ✅  Comprobación jerarquía Municipio→Distrito→Barrio\n",
        "########################################################################################\n",
        "\n",
        "print(\"### Neigbourhood → District\")\n",
        "qrun(\"\"\"\n",
        "SELECT ?municipality ?district WHERE {\n",
        "  ?m a dbo:Neighbourhood ; schema:name ?municipality ; sc:locatedInDistrict ?d .\n",
        "  OPTIONAL { ?d schema:name ?district }\n",
        "}\n",
        "ORDER BY ?municipality ?district\n",
        "\"\"\", limit=5)\n",
        "\n",
        "print(\"\\n### District → Municipality\")\n",
        "qrun(\"\"\"\n",
        "SELECT ?district ?neighbourhood WHERE {\n",
        "  ?d a dbo:District ; schema:name ?district ; sc:locatedInMunicipality ?n .\n",
        "  OPTIONAL { ?n schema:name ?neighbourhood }\n",
        "}\n",
        "ORDER BY ?district ?neighbourhood\n",
        "\"\"\", limit=5)\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 461,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "QWBiOEuUOtoR",
        "outputId": "4ce7cb30-ddc3-426c-fe65-7c915c2b7f25"
      },
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "\n",
            "### Universities → Neighbourhood\n",
            "--- 5 filas ---\n",
            "['Escuela Técnica Superior de Ingenieros de Caminos, Canales y Puertos. Edificio Retiro', 'LOS JERONIMOS']\n",
            "['Escuela Universitaria de Enfermería. Fundación Jiménez Díaz', 'ARGUELLES']\n",
            "['Universidad Complutense de Madrid. Facultad de Informática', 'CIUDAD UNIVERSITARIA']\n",
            "['Centro de Enseñanza Superior en Humanidades y Ciencias de la Educación Don Bosco', 'CIUDAD UNIVERSITARIA']\n",
            "['Residencia Universitaria Tagaste', 'GOYA']\n",
            "\n",
            "### PublicLibraries → Neighbourhood\n",
            "--- 5 filas ---\n",
            "['Biblioteca Pública Municipal Gabriel García Márquez (Usera)', 'ORCASUR']\n",
            "['Biblioteca Pública Municipal Iván de Vargas (Centro)', 'PALACIO']\n",
            "['Biblioteca Pública Municipal Ángel González (Latina)', 'ALUCHE']\n",
            "['Biblioteca Pública Municipal Ciudad Lineal (Ciudad Lineal)', 'PUEBLO NUEVO']\n",
            "['Centro Cultural Paco Rabal. Biblioteca Pública (Puente de Vallecas)', 'PALOMERAS BAJAS']\n",
            "\n",
            "### ParksGardens → Neighbourhood\n",
            "--- 5 filas ---\n",
            "['Parque de Las Cruces', 'BUENAVISTA']\n",
            "['Parque Eugenia de Montijo', 'VISTA ALEGRE']\n",
            "['Parque Mujeres de Orcasitas', 'ORCASITAS']\n",
            "['Parque San José de Calasanz', 'GAZTAMBIDE']\n",
            "['Jardines de Sabatini', 'PALACIO']\n",
            "\n",
            "### SportsCenters → Neighbourhood\n",
            "--- 5 filas ---\n",
            "['Centro Deportivo Municipal Hortaleza', 'APOSTOL SANTIAGO']\n",
            "['Centro Deportivo Municipal Cerro Almodóvar', 'SANTA EUGENIA']\n",
            "['Centro Deportivo Municipal Fuente del Berro', 'FUENTE DEL BERRO']\n",
            "['Centro Deportivo Municipal Vallecas Verano', 'PALOMERAS BAJAS']\n",
            "['Centro Deportivo Municipal Alfredo Goyeneche', 'ARAVACA']\n"
          ]
        }
      ],
      "source": [
        "################################################################################################################\n",
        "# ✅  Comprobar que distintas facilities, parques, sportscenter ... estan asociadas a su → Barrio\n",
        "################################################################################################################\n",
        "\n",
        "for subtype,label in [\n",
        "    (\"sc:EducationalInstitution\",\"Universities\"),\n",
        "    (\"sc:Library\",\"PublicLibraries\"),\n",
        "    (\"sc:Park\",\"ParksGardens\"),\n",
        "    (\"sc:SportsFacility\",\"SportsCenters\")\n",
        "]:\n",
        "    print(f\"\\n### {label} → Neighbourhood\")\n",
        "    qrun(f\"\"\"\n",
        "SELECT ?facility ?neighbourhood WHERE {{\n",
        "  ?f a {subtype} ; schema:containedInPlace ?n .\n",
        "  ?n a dbo:Neighbourhood .\n",
        "  OPTIONAL {{ ?f schema:name ?fraw }}\n",
        "  OPTIONAL {{ ?n schema:name ?nraw }}\n",
        "BIND(COALESCE(?fraw, REPLACE(REPLACE(STR(?f), '^.*/', ''), '%20', ' ')) AS ?facility)\n",
        "BIND(COALESCE(?nraw, REPLACE(REPLACE(STR(?n), '^.*/', ''), '%20', ' ')) AS ?neighbourhood)\n",
        "}}\n",
        "LIMIT 5\n",
        "\"\"\", limit=5)\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 462,
      "metadata": {},
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "\n",
            "### Facilities → Neighbourhood\n",
            "--- 5 filas ---\n",
            "['Parque de la Amistad', 'LOS ROSALES']\n",
            "['Parque Eva Duarte', 'GUINDALERA']\n",
            "['Jardines de la Plaza de Chamberí', 'ALMAGRO']\n",
            "['Parque Sancho Dávila', 'FUENTE DEL BERRO']\n",
            "['Jardín del Maestro Padilla', 'IMPERIAL']\n"
          ]
        }
      ],
      "source": [
        "# 🧭 Comprobar relaciones subclases de Facility → Barrio\n",
        "# - Para cada subclase: lista 5 (Facility, Barrio) por containedInPlace\n",
        "\n",
        "for subtype,label in [\n",
        "    (\"sc:Facility\",\"Facilities\")\n",
        "]:\n",
        "    print(f\"\\n### {label} → Neighbourhood\")\n",
        "    qrun(f\"\"\"\n",
        "SELECT ?facility ?neighbourhood WHERE {{\n",
        "  ?f a {subtype} ; schema:containedInPlace ?n .\n",
        "  ?n a dbo:Neighbourhood .\n",
        "  OPTIONAL {{ ?f schema:name ?fraw }}\n",
        "  OPTIONAL {{ ?n schema:name ?nraw }}\n",
        "BIND(COALESCE(?fraw, REPLACE(REPLACE(STR(?f), '^.*/', ''), '%20', ' ')) AS ?facility)\n",
        "BIND(COALESCE(?nraw, REPLACE(REPLACE(STR(?n), '^.*/', ''), '%20', ' ')) AS ?neighbourhood)\n",
        "}}\n",
        "LIMIT 5\n",
        "\"\"\", limit=5)"
      ]
    }
  ],
  "metadata": {
    "colab": {
      "provenance": []
    },
    "kernelspec": {
      "display_name": "Python 3",
      "name": "python3"
    },
    "language_info": {
      "codemirror_mode": {
        "name": "ipython",
        "version": 3
      },
      "file_extension": ".py",
      "mimetype": "text/x-python",
      "name": "python",
      "nbconvert_exporter": "python",
      "pygments_lexer": "ipython3",
      "version": "3.12.6"
    }
  },
  "nbformat": 4,
  "nbformat_minor": 0
}
