{
  "cells": [
    {
      "cell_type": "code",
      "execution_count": 3,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "8VxIOIgcdUpO",
        "outputId": "6d8cf908-c838-44e6-c97c-3af98bcddd59"
      },
      "outputs": [],
      "source": [
        "# !pip install rdflib\n",
        "# !pip install morph-kgc\n",
        "# !pip install owlrl\n",
        "# !pip install sqlalchemy"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 4,
      "metadata": {},
      "outputs": [
        {
          "name": "stderr",
          "output_type": "stream",
          "text": [
            "DEBUG | 2025-11-16 14:49:34,104 | CONFIGURATION: {'output_file': '../rdf/tripletas-Final', 'number_of_processes': '1', 'logging_level': 'DEBUG', 'safe_percent_encoding': \":/?#[]@!$&'()*+,;=%-._~\", 'na_values': ',nan', 'literal_escaping_chars': '\",\\n,\\r', 'read_parsed_mappings_path': '', 'write_parsed_mappings_path': '', 'mapping_partitioning': 'PARTIAL-AGGREGATIONS', 'logging_file': '', 'udfs': '', 'output_kafka_server': '', 'output_kafka_topic': '', 'output_dir': '', 'output_format': 'N-TRIPLES', 'only_printable_chars': 'no', 'infer_sql_datatypes': 'no'}\n",
            "DEBUG | 2025-11-16 14:49:34,106 | DATA SOURCE `DataSourceCSV`: {'mappings': 'rml-map-with-links-Final.ttl'}\n",
            "INFO | 2025-11-16 14:49:34,107 | Parallelization is not supported for win32 when running as a library. If you need to speed up your data integration pipeline, please run through the command line.\n"
          ]
        },
        {
          "ename": "FileNotFoundError",
          "evalue": "[Errno 2] No such file or directory: 'rml-map-with-links-Final.ttl'",
          "output_type": "error",
          "traceback": [
            "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
            "\u001b[1;31mFileNotFoundError\u001b[0m                         Traceback (most recent call last)",
            "Cell \u001b[1;32mIn[4], line 2\u001b[0m\n\u001b[0;32m      1\u001b[0m \u001b[38;5;28;01mimport\u001b[39;00m \u001b[38;5;21;01mmorph_kgc\u001b[39;00m\n\u001b[1;32m----> 2\u001b[0m g \u001b[38;5;241m=\u001b[39m \u001b[43mmorph_kgc\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mmaterialize\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;124;43m'\u001b[39;49m\u001b[38;5;124;43m../mappings/config.ini\u001b[39;49m\u001b[38;5;124;43m'\u001b[39;49m\u001b[43m)\u001b[49m\n\u001b[0;32m      4\u001b[0m g\u001b[38;5;241m.\u001b[39mserialize(destination\u001b[38;5;241m=\u001b[39m\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mresultado.nt\u001b[39m\u001b[38;5;124m'\u001b[39m, \u001b[38;5;28mformat\u001b[39m\u001b[38;5;241m=\u001b[39m\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mnt\u001b[39m\u001b[38;5;124m'\u001b[39m)\n\u001b[0;32m      5\u001b[0m \u001b[38;5;28mprint\u001b[39m(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mArchivo resultado.nt generado\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n",
            "File \u001b[1;32mc:\\Users\\julia\\AppData\\Local\\Programs\\Python\\Python312\\Lib\\site-packages\\morph_kgc\\__init__.py:65\u001b[0m, in \u001b[0;36mmaterialize\u001b[1;34m(config, python_source)\u001b[0m\n\u001b[0;32m     64\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21mmaterialize\u001b[39m(config, python_source\u001b[38;5;241m=\u001b[39m\u001b[38;5;28;01mNone\u001b[39;00m):\n\u001b[1;32m---> 65\u001b[0m     triples \u001b[38;5;241m=\u001b[39m \u001b[43mmaterialize_set\u001b[49m\u001b[43m(\u001b[49m\u001b[43mconfig\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mpython_source\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m     67\u001b[0m     graph \u001b[38;5;241m=\u001b[39m Graph()\n\u001b[0;32m     68\u001b[0m     \u001b[38;5;28;01mif\u001b[39;00m triples:\n",
            "File \u001b[1;32mc:\\Users\\julia\\AppData\\Local\\Programs\\Python\\Python312\\Lib\\site-packages\\morph_kgc\\__init__.py:39\u001b[0m, in \u001b[0;36mmaterialize_set\u001b[1;34m(config, python_source)\u001b[0m\n\u001b[0;32m     34\u001b[0m     LOGGER\u001b[38;5;241m.\u001b[39minfo(\n\u001b[0;32m     35\u001b[0m         \u001b[38;5;124mf\u001b[39m\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mParallelization is not supported for \u001b[39m\u001b[38;5;132;01m{\u001b[39;00msys\u001b[38;5;241m.\u001b[39mplatform\u001b[38;5;132;01m}\u001b[39;00m\u001b[38;5;124m when running as a library. \u001b[39m\u001b[38;5;124m'\u001b[39m\n\u001b[0;32m     36\u001b[0m         \u001b[38;5;124mf\u001b[39m\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mIf you need to speed up your data integration pipeline, please run through the command line.\u001b[39m\u001b[38;5;124m'\u001b[39m)\n\u001b[0;32m     37\u001b[0m     config\u001b[38;5;241m.\u001b[39mset_number_of_processes(\u001b[38;5;124m'\u001b[39m\u001b[38;5;124m1\u001b[39m\u001b[38;5;124m'\u001b[39m)\n\u001b[1;32m---> 39\u001b[0m rml_df, fnml_df, http_api_df \u001b[38;5;241m=\u001b[39m \u001b[43mretrieve_mappings\u001b[49m\u001b[43m(\u001b[49m\u001b[43mconfig\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m     41\u001b[0m \u001b[38;5;66;03m# keep only asserted mapping rules\u001b[39;00m\n\u001b[0;32m     42\u001b[0m asserted_mapping_df \u001b[38;5;241m=\u001b[39m rml_df\u001b[38;5;241m.\u001b[39mloc[rml_df[\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mtriples_map_type\u001b[39m\u001b[38;5;124m'\u001b[39m] \u001b[38;5;241m==\u001b[39m RML_TRIPLES_MAP_CLASS]\n",
            "File \u001b[1;32mc:\\Users\\julia\\AppData\\Local\\Programs\\Python\\Python312\\Lib\\site-packages\\morph_kgc\\mapping\\mapping_parser.py:22\u001b[0m, in \u001b[0;36mretrieve_mappings\u001b[1;34m(config)\u001b[0m\n\u001b[0;32m     19\u001b[0m mappings_parser \u001b[38;5;241m=\u001b[39m MappingParser(config)\n\u001b[0;32m     21\u001b[0m start_time \u001b[38;5;241m=\u001b[39m time\u001b[38;5;241m.\u001b[39mtime()\n\u001b[1;32m---> 22\u001b[0m rml_df, fnml_df, http_api_df \u001b[38;5;241m=\u001b[39m \u001b[43mmappings_parser\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mparse_mappings\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m     23\u001b[0m LOGGER\u001b[38;5;241m.\u001b[39minfo(\u001b[38;5;124mf\u001b[39m\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mMappings processed in \u001b[39m\u001b[38;5;132;01m{\u001b[39;00mget_delta_time(start_time)\u001b[38;5;132;01m}\u001b[39;00m\u001b[38;5;124m seconds.\u001b[39m\u001b[38;5;124m'\u001b[39m)\n\u001b[0;32m     25\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m rml_df, fnml_df, http_api_df\n",
            "File \u001b[1;32mc:\\Users\\julia\\AppData\\Local\\Programs\\Python\\Python312\\Lib\\site-packages\\morph_kgc\\mapping\\mapping_parser.py:502\u001b[0m, in \u001b[0;36mMappingParser.parse_mappings\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m    501\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21mparse_mappings\u001b[39m(\u001b[38;5;28mself\u001b[39m):\n\u001b[1;32m--> 502\u001b[0m     \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_get_from_r2_rml\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    503\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_preprocess_mappings()\n\u001b[0;32m    505\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_infer_datatypes()\n",
            "File \u001b[1;32mc:\\Users\\julia\\AppData\\Local\\Programs\\Python\\Python312\\Lib\\site-packages\\morph_kgc\\mapping\\mapping_parser.py:533\u001b[0m, in \u001b[0;36mMappingParser._get_from_r2_rml\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m    526\u001b[0m \u001b[38;5;66;03m# previously parsing was paralellized\u001b[39;00m\n\u001b[0;32m    527\u001b[0m \u001b[38;5;66;03m#if self.config.is_multiprocessing_enabled() and self.config.has_multiple_data_sources():\u001b[39;00m\n\u001b[0;32m    528\u001b[0m \u001b[38;5;66;03m#    pool = mp.Pool(self.config.get_number_of_processes())\u001b[39;00m\n\u001b[0;32m    529\u001b[0m \u001b[38;5;66;03m#    rml_dfs = pool.map(self._parse_data_source_mapping_files, self.config.get_data_sources_sections())\u001b[39;00m\n\u001b[0;32m    530\u001b[0m \u001b[38;5;66;03m#    self.rml_df = pd.concat([self.rml_df, pd.concat(rml_dfs)])\u001b[39;00m\n\u001b[0;32m    531\u001b[0m \u001b[38;5;66;03m#else:\u001b[39;00m\n\u001b[0;32m    532\u001b[0m \u001b[38;5;28;01mfor\u001b[39;00m section_name \u001b[38;5;129;01min\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mconfig\u001b[38;5;241m.\u001b[39mget_data_sources_sections():\n\u001b[1;32m--> 533\u001b[0m     data_source_rml_df, data_source_fnml_df, data_source_http_api_df \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_parse_data_source_mapping_files\u001b[49m\u001b[43m(\u001b[49m\u001b[43msection_name\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    534\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mrml_df \u001b[38;5;241m=\u001b[39m pd\u001b[38;5;241m.\u001b[39mconcat([\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mrml_df, data_source_rml_df])\n\u001b[0;32m    535\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mfnml_df \u001b[38;5;241m=\u001b[39m pd\u001b[38;5;241m.\u001b[39mconcat([\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mfnml_df, data_source_fnml_df])\n",
            "File \u001b[1;32mc:\\Users\\julia\\AppData\\Local\\Programs\\Python\\Python312\\Lib\\site-packages\\morph_kgc\\mapping\\mapping_parser.py:553\u001b[0m, in \u001b[0;36mMappingParser._parse_data_source_mapping_files\u001b[1;34m(self, section_name)\u001b[0m\n\u001b[0;32m    550\u001b[0m \u001b[38;5;66;03m# create an empty graph\u001b[39;00m\n\u001b[0;32m    551\u001b[0m mapping_graph \u001b[38;5;241m=\u001b[39m rdflib\u001b[38;5;241m.\u001b[39mGraph()\n\u001b[1;32m--> 553\u001b[0m mapping_file_paths \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mconfig\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mget_mappings_files\u001b[49m\u001b[43m(\u001b[49m\u001b[43msection_name\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    554\u001b[0m \u001b[38;5;66;03m# load mapping rules to the graph\u001b[39;00m\n\u001b[0;32m    555\u001b[0m \u001b[38;5;28;01mfor\u001b[39;00m f \u001b[38;5;129;01min\u001b[39;00m mapping_file_paths:\n",
            "File \u001b[1;32mc:\\Users\\julia\\AppData\\Local\\Programs\\Python\\Python312\\Lib\\site-packages\\morph_kgc\\config.py:340\u001b[0m, in \u001b[0;36mConfig.get_mappings_files\u001b[1;34m(self, source_section)\u001b[0m\n\u001b[0;32m    338\u001b[0m         mapping_file_paths\u001b[38;5;241m.\u001b[39mappend(mapping_path)\n\u001b[0;32m    339\u001b[0m     \u001b[38;5;28;01melse\u001b[39;00m:\n\u001b[1;32m--> 340\u001b[0m         \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;167;01mFileNotFoundError\u001b[39;00m(errno\u001b[38;5;241m.\u001b[39mENOENT, os\u001b[38;5;241m.\u001b[39mstrerror(errno\u001b[38;5;241m.\u001b[39mENOENT), mapping_path)\n\u001b[0;32m    342\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m mapping_file_paths\n",
            "\u001b[1;31mFileNotFoundError\u001b[0m: [Errno 2] No such file or directory: 'rml-map-with-links-Final.ttl'"
          ]
        }
      ],
      "source": [
        "import morph_kgc\n",
        "g = morph_kgc.materialize('../mappings/config.ini')\n",
        "\n",
        "g.serialize(destination='resultado.nt', format='nt')\n",
        "print(\"Archivo resultado.nt generado\")"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {},
      "outputs": [
        {
          "data": {
            "text/plain": [
              "<Graph identifier=Nca307fa3050c4389a459473fd15bad2e (<class 'rdflib.graph.Graph'>)>"
            ]
          },
          "execution_count": 449,
          "metadata": {},
          "output_type": "execute_result"
        }
      ],
      "source": [
        "from rdflib import Graph\n",
        "from owlrl import DeductiveClosure, RDFS_Semantics\n",
        "\n",
        "g = Graph()\n",
        "\n",
        "g.parse(\"../ontology/ontology.ttl\", format=\"turtle\")\n",
        "g.parse(\"resultado.nt\", format=\"nt\")\n",
        "\n",
        "# DeductiveClosure(RDFS_Semantics).expand(g)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {},
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "Triples cargados: 8221\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/EducationalInstitution/Universidad-Complutense-de-Madrid.-Facultad-de-Filologia https://schema.org/postalCode 28040\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/EducationalInstitution/Colegio-Universitario-de-Estudios-Financieros https://schema.org/name Colegio Universitario de Estudios Financieros\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/SportsFacility/Centro-Deportivo-Municipal-La-Cebada-%28antigua-La-Latina%29 http://www.w3.org/2003/01/geo/wgs84_pos#lat 40.410546084176566\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Park/Parque-de-la-Amistad http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://smartcity.linkeddata.es/lcc/ontology#Facility\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Park/Parque-Eva-Duarte http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://smartcity.linkeddata.es/lcc/ontology#Facility\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/SportsFacility/Centro-Deportivo-Municipal-Hortaleza http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://smartcity.linkeddata.es/lcc/ontology#SportsFacility\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/SportsFacility/Centro-Deportivo-Municipal-Ciudad-de-los-Poetas http://smartcity.linkeddata.es/lcc/ontology#accessibility No accesible\n",
            "http://smartcity.linkeddata.es/lcc/resource/subway/Metro%3A%20Canillejas%2C%20Torre%20Arias%20%28l%C3%ADnea%205%29 http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://smartcity.linkeddata.es/lcc/ontology#Subway\n",
            "http://smartcity.linkeddata.es/lcc/resource/bus/Bus%3A%20104%2C%2077%2C%20140%2C%20153 http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://smartcity.linkeddata.es/lcc/ontology#Bus\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/EducationalInstitution/Colegio-Mayor-Barberan-y-Collar https://schema.org/email cmubarberan@mde.es\n",
            "http://smartcity.linkeddata.es/lcc/resource/bus/Bus%3A18%2C%2062 http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://smartcity.linkeddata.es/lcc/ontology#Bus\n",
            "http://smartcity.linkeddata.es/lcc/resource/bus/Bus%3A%2034 http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://smartcity.linkeddata.es/lcc/ontology#Bus\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Park/Jardin-del-Maestro-Padilla http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://smartcity.linkeddata.es/lcc/ontology#Facility\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/EducationalInstitution/Escuela-Tecnica-Superior-de-Ingenieros-Industriales http://www.w3.org/2003/01/geo/wgs84_pos#lat 40.44042600324054\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/EducationalInstitution/Universidad-Complutense-de-Madrid.-Facultad-de-Bellas-Artes https://schema.org/containedInPlace http://smartcity.linkeddata.es/lcc/resource/neighbourhood/CIUDAD%20UNIVERSITARIA\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/EducationalInstitution/Universidad-Autonoma-de-Madrid.-Facultad-de-Formacion-de-Profesorado-y-Educacion http://www.w3.org/2003/01/geo/wgs84_pos#long -3.697774510862534\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Library/Biblioteca-Publica-Municipal-Francisco-Ibanez-%28Chamartin%29 https://schema.org/containedInPlace http://smartcity.linkeddata.es/lcc/resource/neighbourhood/CIUDAD%20JARDIN\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Park/Jardines-de-la-Basilica http://smartcity.linkeddata.es/lcc/ontology#hasNearby http://smartcity.linkeddata.es/lcc/resource/train/Renfe%3A%20Nuevos%20Ministerios%20%28l%C3%ADneas%20C1%2C%20C3%2C%20C4%2C%20C7%2C%20C8%2C%20C10%29\n",
            "http://smartcity.linkeddata.es/lcc/resource/subway/Metro%3A%20Canillejas%2C%20Torre%20Arias%20%28l%C3%ADnea%205%29 http://smartcity.linkeddata.es/lcc/ontology#hasStations Canillejas, Torre Arias\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Library/Biblioteca-Publica-del-Estado-Manuel-Alvar-%28Salamanca%29 https://schema.org/postalCode 28028\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Library/Biblioteca-Publica-Municipal-Portazgo-%28Puente-de-Vallecas%29 https://schema.org/name Biblioteca Pública Municipal Portazgo (Puente de Vallecas)\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/SportsFacility/Centro-Deportivo-Municipal-Fabian-Roncero https://schema.org/addressRegion MADRID\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/EducationalInstitution/Universidad-Complutense-de-Madrid.-Facultad-de-Medicina https://schema.org/addressRegion MADRID\n",
            "http://smartcity.linkeddata.es/lcc/resource/subway/Metro%3A%20P%C3%ADo%20XII http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://smartcity.linkeddata.es/lcc/ontology#Subway\n",
            "http://smartcity.linkeddata.es/lcc/resource/bus/Bus%3A%20E3%20%2C%204%20%2C%20100%20%2C%20106%20%2C%20130 http://smartcity.linkeddata.es/lcc/ontology#hasLines 3\n",
            "4\n",
            "100\n",
            "106\n",
            "130\n",
            "http://smartcity.linkeddata.es/lcc/resource/bus/Bus%3A%2010%2C%2014%2C%2032%2C%2056%2C%2063%2C%20143%2C%20145%2C%20E http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://smartcity.linkeddata.es/lcc/ontology#Bus\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/EducationalInstitution/Colegio-Mayor-Nuestra-Senora-de-Guadalupe https://schema.org/addressRegion MADRID\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Park/Parque-Urpisa https://schema.org/addressRegion MADRID\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/EducationalInstitution/Instituto-de-Estudios-Bursatiles https://schema.org/name Instituto de Estudios Bursátiles\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Park/Parque-Nudo-Norte-de-Begona https://schema.org/containedInPlace http://smartcity.linkeddata.es/lcc/resource/neighbourhood/VALVERDE\n",
            "http://smartcity.linkeddata.es/lcc/resource/bus/Bus%3A%203%2C%2060%20y%20148 http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://smartcity.linkeddata.es/lcc/ontology#Bus\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/SportsFacility/Centro-Deportivo-Municipal-Lago-Casa-de-Campo https://schema.org/name Centro Deportivo Municipal Lago Casa de Campo\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/EducationalInstitution/Colegio-Mayor-Ximenez-de-Cisneros http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://smartcity.linkeddata.es/lcc/ontology#ResidenceHall\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Park/Parque-de-Juan-XXIII https://schema.org/containedInPlace http://smartcity.linkeddata.es/lcc/resource/neighbourhood/CIUDAD%20UNIVERSITARIA\n",
            "http://smartcity.linkeddata.es/lcc/resource/bus/Bus%3A%203%20%2C%2031%20%2C%2050%20%2C%2065%20%2C%20148 http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://smartcity.linkeddata.es/lcc/ontology#Bus\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Library/Biblioteca-Publica-Pedro-Salinas-%28Centro%29 http://www.w3.org/2003/01/geo/wgs84_pos#long -3.7110439355238602\n",
            "http://smartcity.linkeddata.es/lcc/resource/bus/Bus%3A%2031%20%2C%2041%20%2C%2050%20%2C%2065 http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://smartcity.linkeddata.es/lcc/ontology#Bus\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Park/Parque-de-La-Rinconada http://smartcity.linkeddata.es/lcc/ontology#surface 42739\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Park/Jardin-Dona-Concha-Piquer http://smartcity.linkeddata.es/lcc/ontology#hasSportsFacilities no\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/EducationalInstitution/Universidad-Complutense-de-Madrid.-Facultad-de-Ciencias-Geologicas https://schema.org/containedInPlace http://smartcity.linkeddata.es/lcc/resource/neighbourhood/CIUDAD%20UNIVERSITARIA\n",
            "http://smartcity.linkeddata.es/lcc/resource/bus/Bus%3A%20114%20%2C%20115 http://smartcity.linkeddata.es/lcc/ontology#hasLines 114\n",
            "115\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Park/Parque-Eugenia-de-Montijo http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://smartcity.linkeddata.es/lcc/ontology#Park\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/SportsFacility/Centro-Deportivo-Municipal-Penuelas http://smartcity.linkeddata.es/lcc/ontology#hasNearby http://smartcity.linkeddata.es/lcc/resource/subway/Metro%3A%20Acacias%2C%20Embajadores%2C%20Pir%C3%A1mides\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Park/Parque-Valdebernardo-Este http://smartcity.linkeddata.es/lcc/ontology#hasSportsFacilities sí\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Park/Jardin-de-Embajadores-M-30 http://smartcity.linkeddata.es/lcc/ontology#hasSportsFacilities sí\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Park/Jardines-del-Principe-de-Anglona http://smartcity.linkeddata.es/lcc/ontology#hasNearby http://smartcity.linkeddata.es/lcc/resource/subway/Metro%3A%20La%20Latina%20%28l%C3%ADnea%205%29\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/EducationalInstitution/Colegio-Mayor-Ximenez-de-Cisneros http://smartcity.linkeddata.es/lcc/ontology#studentGender mixto\n",
            "http://smartcity.linkeddata.es/lcc/ontology# http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://www.w3.org/2002/07/owl#Ontology\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/SportsFacility/Centro-Deportivo-Municipal-Blanca-Fernandez-Ochoa-%28La-Mina%29 https://schema.org/streetAddress MONSEÑOR OSCAR ROMERO\n",
            "http://smartcity.linkeddata.es/lcc/resource/subway/Metro%3A%20Vicente%20Aleixandre%20%28l%C3%ADnea%206%29%2C%20Islas%20Filipinas%20%28l%C3%ADnea%207%29 http://smartcity.linkeddata.es/lcc/ontology#hasLines 6\n",
            "7\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/EducationalInstitution/Universidad-Complutense-de-Madrid.-Facultad-de-Estudios-Estadisticos https://schema.org/email pgweb@estad.ucm.es\n",
            "http://smartcity.linkeddata.es/lcc/resource/train/Renfe%3A%20Pir%C3%A1mides%20%28l%C3%ADneas%20C1%20y%20C10%29 http://smartcity.linkeddata.es/lcc/ontology#hasStations Pirámides\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/EducationalInstitution/Colegio-Mayor-Universitario-San-Pablo https://schema.org/streetAddress ISAAC PERAL\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Library/Biblioteca-Publica-Municipal-Pozo-del-Tio-Raimundo-%28Puente-de-Vallecas%29 https://schema.org/containedInPlace http://smartcity.linkeddata.es/lcc/resource/neighbourhood/ENTREVIAS\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/EducationalInstitution/Escuela-Universitaria-de-Enfermeria.-Fundacion-Jimenez-Diaz http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://smartcity.linkeddata.es/lcc/ontology#EducationalInstitution\n",
            "http://smartcity.linkeddata.es/lcc/resource/facility/Park/Parque-Concejal-Miguel-Martin-Vela http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://smartcity.linkeddata.es/lcc/ontology#Facility\n"
          ]
        }
      ],
      "source": [
        "PREFIXES = \"\"\"\n",
        "PREFIX sc:     <http://smartcity.linkeddata.es/lcc/ontology#> \n",
        "PREFIX schema: <https://schema.org/> \n",
        "PREFIX geo:    <http://www.w3.org/2003/01/geo/wgs84_pos#> \n",
        "PREFIX dbo:    <http://dbpedia.org/ontology/> \n",
        "PREFIX owl:    <http://www.w3.org/2002/07/owl#> \n",
        "PREFIX rdfs:   <http://www.w3.org/2000/01/rdf-schema#> \n",
        "PREFIX xsd:    <http://www.w3.org/2001/XMLSchema#> \n",
        "\"\"\"\n",
        "\n",
        "\n",
        "print(f\"Triples cargados: {len(g)}\")\n",
        "\n",
        "# Mostrar las primeras 10 tripletas\n",
        "for i, (s, p, o) in enumerate(g):\n",
        "    print(s, p, o)\n",
        "    if i >= 55:\n",
        "        break"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "NqmE7mTae1ND",
        "outputId": "61ea6aaa-ec43-492a-f847-8a8987d8c30c"
      },
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "Triples cargados: 8221\n"
          ]
        }
      ],
      "source": [
        "print(f\"Triples cargados: {len(g)}\")\n",
        "\n",
        "PREFIXES = \"\"\"\n",
        "PREFIX sc:     <http://smartcity.linkeddata.es/lcc/ontology#>\n",
        "PREFIX schema: <https://schema.org/>\n",
        "PREFIX dbo:    <http://dbpedia.org/ontology/>\n",
        "PREFIX geo:    <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
        "\"\"\"\n",
        "\n",
        "def qrun(q, limit=50):\n",
        "    q = PREFIXES + q\n",
        "    res = g.query(q)\n",
        "    print(f\"--- {len(res)} filas ---\")\n",
        "    for i,row in enumerate(res):\n",
        "        print([str(x) if x is not None else None for x in row])\n",
        "        if i >= limit-1: break"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {},
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "--- 4 filas ---\n",
            "['Educational Institution', '117']\n",
            "['Library', '50']\n",
            "['Park or Garden', '203']\n",
            "['Sport Facility', '81']\n"
          ]
        }
      ],
      "source": [
        "########################################################################################\n",
        "# ✅ Número de individuos de cada subclase de Facility (tabla con tipo y conteo)\n",
        "# - Devuelve una fila por subclase: University, Library, ParkGarden, SportsCenter\n",
        "########################################################################################\n",
        "\n",
        "qrun(\"\"\"\n",
        "SELECT ?type (COUNT(?x) AS ?count) WHERE {\n",
        "  ?x a ?subclass .\n",
        "  ?subclass rdfs:subClassOf sc:Facility .\n",
        "  ?subclass rdfs:label ?type .\n",
        "}\n",
        "GROUP BY ?type\n",
        "ORDER BY ?type\n",
        "\"\"\")\n",
        "\n",
        "\n",
        "# --- 8 filas ---\n",
        "# ['Educational Institution', '117']\n",
        "# ['Faculty', '35']\n",
        "# ['Library', '50']\n",
        "# ['Other Centers', '13']\n",
        "# ['Park or Garden', '203']\n",
        "# ['Residence Hall', '48']\n",
        "# ['Sport Facility', '81']\n",
        "# ['University School', '21']"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {},
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "--- 4 filas ---\n",
            "['Faculty', '35']\n",
            "['Other Centers', '13']\n",
            "['Residence Hall', '48']\n",
            "['University School', '21']\n"
          ]
        }
      ],
      "source": [
        "qrun(\"\"\"\n",
        "SELECT ?type (COUNT(?x) AS ?count) WHERE {\n",
        "  ?x a ?subclass .\n",
        "  ?subclass rdfs:subClassOf sc:EducationalInstitution .\n",
        "  ?subclass rdfs:label ?type .\n",
        "}\n",
        "GROUP BY ?type\n",
        "ORDER BY ?type\n",
        "\"\"\")\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {},
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "\n",
            "### EducationalInstitutions\n",
            "--- 5 filas ---\n",
            "['Escuela Técnica Superior de Ingenieros de Caminos, Canales y Puertos. Edificio Retiro']\n",
            "['Escuela Universitaria de Enfermería. Fundación Jiménez Díaz']\n",
            "['Universidad Complutense de Madrid. Facultad de Informática']\n",
            "['Centro de Enseñanza Superior en Humanidades y Ciencias de la Educación Don Bosco']\n",
            "['Residencia Universitaria Tagaste']\n",
            "\n",
            "### PublicLibraries\n",
            "--- 5 filas ---\n",
            "['Biblioteca Pública Municipal Gabriel García Márquez (Usera)']\n",
            "['Biblioteca Pública Municipal Iván de Vargas (Centro)']\n",
            "['Biblioteca Pública Municipal Ángel González (Latina)']\n",
            "['Biblioteca Pública Municipal Ciudad Lineal (Ciudad Lineal)']\n",
            "['Centro Cultural Paco Rabal. Biblioteca Pública (Puente de Vallecas)']\n",
            "\n",
            "### ParksGardens\n",
            "--- 5 filas ---\n",
            "['Parque de Las Cruces']\n",
            "['Parque Eugenia de Montijo']\n",
            "['Parque Mujeres de Orcasitas']\n",
            "['Parque San José de Calasanz']\n",
            "['Jardines de Sabatini']\n",
            "\n",
            "### SportsCenters\n",
            "--- 5 filas ---\n",
            "['Centro Deportivo Municipal Hortaleza']\n",
            "['Centro Deportivo Municipal Cerro Almodóvar']\n",
            "['Centro Deportivo Municipal Fuente del Berro']\n",
            "['Centro Deportivo Municipal Vallecas Verano']\n",
            "['Centro Deportivo Municipal Alfredo Goyeneche']\n"
          ]
        }
      ],
      "source": [
        "########################################################################################\n",
        "# ✅ Número de individuos de cada subclase DIRECTA de Facility, no aparecen subclases de subclases \n",
        "# - Devuelve una fila por subclase: University, Library, ParkGarden, SportsCenter\n",
        "########################################################################################\n",
        "\n",
        "for subtype,label in [\n",
        "    (\"sc:EducationalInstitution\",\"EducationalInstitutions\"),\n",
        "    (\"sc:Library\",\"PublicLibraries\"),\n",
        "    (\"sc:Park\",\"ParksGardens\"),\n",
        "    (\"sc:SportsFacility\",\"SportsCenters\")\n",
        "]:\n",
        "    print(f\"\\n### {label}\")\n",
        "    qrun(f\"\"\"\n",
        "SELECT ?name WHERE {{\n",
        "  ?x a {subtype} .\n",
        "\n",
        "  # Filtrar solo subclases directas de Facility\n",
        "  ?subclass rdfs:subClassOf sc:Facility .\n",
        "  ?x a ?subclass .\n",
        "\n",
        "  OPTIONAL {{ ?x schema:name ?raw }}\n",
        "  BIND(COALESCE(?raw, REPLACE(STR(?x), '^.*/', '')) AS ?name)\n",
        "}}\n",
        "LIMIT 5\n",
        "\"\"\", limit=5)\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {},
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "--- 3 filas ---\n",
            "['Bus']\n",
            "['Subway']\n",
            "['Train']\n"
          ]
        }
      ],
      "source": [
        "########################################################################################\n",
        "# ✅ Tipos de Public Transport, suclases de public transport: (subwary, train, bus)\n",
        "########################################################################################\n",
        "\n",
        "qrun(\"\"\"\n",
        "SELECT ?type WHERE {\n",
        "  ?x a ?subclass .\n",
        "  ?subclass rdfs:subClassOf sc:PublicTransport .\n",
        "  ?subclass rdfs:label ?type .\n",
        "}\n",
        "GROUP BY ?type\n",
        "ORDER BY ?type\n",
        "\"\"\")"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "4wyiHJ6SOS1Z",
        "outputId": "97d4d58f-ad91-4018-bb3d-c2e6bcf25bb5"
      },
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "\n",
            "### Metro Stations\n",
            "--- 5 filas ---\n",
            "['Canillejas, Torre Arias']\n",
            "['Pacífico']\n",
            "['Pío XII']\n",
            "['Carabanchel , Eugenia de Montijo']\n",
            "['Villaverde Bajo Cruce']\n",
            "\n",
            "### Train Stations\n",
            "--- 5 filas ---\n",
            "['Orcasitas']\n",
            "['El Pozo']\n",
            "[': Villaverde Bajo']\n",
            "['Embajadores']\n",
            "['Príncipe Pío']\n"
          ]
        }
      ],
      "source": [
        "########################################################################################\n",
        "# ✅ 5 ejemplos de Estaciones de Metro y Tren \n",
        "########################################################################################\n",
        "\n",
        "for ttype, label in [\n",
        "    (\"sc:Subway\", \"Metro Stations\"),  # Cambiamos de SubwayStation a Subway\n",
        "    (\"sc:Train\", \"Train Stations\")  # Cambiamos de TrainStation a Train\n",
        "]:\n",
        "    print(f\"\\n### {label}\")\n",
        "    # Modificamos la consulta para buscar el recurso de transporte (?t)\n",
        "    qrun(f\"\"\"\n",
        "SELECT DISTINCT ?stationName WHERE {{\n",
        "  ?t a {ttype} .        \n",
        "  ?t sc:hasStations ?stationName .\n",
        "}}\n",
        "LIMIT 5\n",
        "\"\"\", limit=5)\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {},
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "\n",
            "### Metro lines\n",
            "--- 5 filas ---\n",
            "['5']\n",
            "['3']\n",
            "['9']\n",
            "['2']\n",
            "['6']\n",
            "\n",
            "### Train lines\n",
            "--- 5 filas ---\n",
            "['C-5']\n",
            "['C-2\\r\\nC-7\\r\\nC-8']\n",
            "['C-3\\r\\nC-4']\n",
            "['C-1\\r\\nC-7\\r\\nC-10']\n",
            "['C-3\\r\\nC-7\\r\\nC-8']\n",
            "\n",
            "### Bus lines\n",
            "--- 5 filas ---\n",
            "['104\\r\\n77\\r\\n140\\r\\n153']\n",
            "['18\\r\\n62']\n",
            "['34']\n",
            "['10\\r\\n14\\r\\n32\\r\\n56\\r\\n63\\r\\n143\\r\\n145']\n",
            "['3\\r\\n60\\r\\n148']\n"
          ]
        }
      ],
      "source": [
        "########################################################################################\n",
        "# ✅ 5 ejemplos de Lineas de Metro, Tren y bus\n",
        "########################################################################################\n",
        "\n",
        "for ttype, label in [\n",
        "    (\"sc:Subway\", \"Metro lines\"),  \n",
        "    (\"sc:Train\", \"Train lines\"),  \n",
        "    (\"sc:Bus\", \"Bus lines\") \n",
        "]:\n",
        "    print(f\"\\n### {label}\")\n",
        "    qrun(f\"\"\"\n",
        "SELECT DISTINCT ?busLine WHERE {{\n",
        "  ?t a {ttype} .        \n",
        "  ?t sc:hasLines ?busLine .\n",
        "}}\n",
        "LIMIT 5\n",
        "\"\"\", limit=5)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "Nb4kKH8IOknl",
        "outputId": "b99a6de9-231e-4bf0-c935-82a8507847ac"
      },
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "--- 3 filas ---\n",
            "['District', '22']\n",
            "['Municipality', '1']\n",
            "['Neighbourhood', '118']\n"
          ]
        }
      ],
      "source": [
        "########################################################################################\n",
        "# ✅ Número de Municipios, Distritos y Barrios distintos\n",
        "########################################################################################\n",
        "\n",
        "qrun(\"\"\"\n",
        "SELECT ?type (COUNT(DISTINCT ?entity) AS ?count)\n",
        "WHERE {\n",
        "  { ?entity a dbo:Municipality  BIND(\"Municipality\"  AS ?type) } UNION\n",
        "  { ?entity a dbo:District      BIND(\"District\"      AS ?type) } UNION\n",
        "  { ?entity a dbo:Neighbourhood BIND(\"Neighbourhood\" AS ?type) }\n",
        "}\n",
        "GROUP BY ?type\n",
        "ORDER BY ?type\n",
        "     \n",
        "\"\"\")"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "OcNePZc-OmLg",
        "outputId": "d6b13284-95cd-43ac-ecc6-41d71900a192"
      },
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "\n",
            "### Municipality\n",
            "--- 1 filas ---\n",
            "['MADRID']\n",
            "\n",
            "### District\n",
            "--- 5 filas ---\n",
            "['TETUAN']\n",
            "['CHAMARTIN']\n",
            "['DISTRITO']\n",
            "['FUENCARRAL-EL PARDO']\n",
            "['CENTRO']\n",
            "\n",
            "### Neighbourhood\n",
            "--- 5 filas ---\n",
            "['CASTILLA']\n",
            "['JUSTICIA']\n",
            "['ALMENDRALES']\n",
            "['MIRASIERRA']\n",
            "['PROSPERIDAD']\n"
          ]
        }
      ],
      "source": [
        "########################################################################################\n",
        "# ✅  5 ejemplos de Municipio, Distrito y Barrio (solo nombre)\n",
        "########################################################################################\n",
        "\n",
        "for ctype,label in [\n",
        "    (\"dbo:Municipality\", \"Municipality\"),\n",
        "    (\"dbo:District\", \"District\"),\n",
        "    (\"dbo:Neighbourhood\", \"Neighbourhood\"),\n",
        "]:\n",
        "    print(f\"\\n### {label}\")\n",
        "    qrun(f\"\"\"\n",
        "SELECT ?name WHERE {{\n",
        "  ?x a {ctype} .\n",
        "  OPTIONAL {{ ?x schema:name ?raw }}\n",
        "  BIND(COALESCE(?raw, REPLACE(STR(?x), '^.*/', '')) AS ?name)\n",
        "}}\n",
        "LIMIT 5\n",
        "\"\"\", limit=5)\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "Q4w6x0grOpRZ",
        "outputId": "15ebe865-1308-4359-c010-1b44a1adf28d"
      },
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "### Neigbourhood → District\n",
            "--- 119 filas ---\n",
            "['ABRANTES', 'CARABANCHEL']\n",
            "['ACACIAS', 'ARGANZUELA']\n",
            "['ADELFAS', 'RETIRO']\n",
            "['ALAMEDA DE OSUNA', 'BARAJAS']\n",
            "['ALMAGRO', 'CHAMBERI']\n",
            "\n",
            "### District → Municipality\n",
            "--- 22 filas ---\n",
            "['ARGANZUELA', 'MADRID']\n",
            "['BARAJAS', 'MADRID']\n",
            "['CARABANCHEL', 'MADRID']\n",
            "['CENTRO', 'MADRID']\n",
            "['CHAMARTIN', 'MADRID']\n"
          ]
        }
      ],
      "source": [
        "########################################################################################\n",
        "# ✅  Comprobación jerarquía Municipio→Distrito→Barrio\n",
        "########################################################################################\n",
        "\n",
        "print(\"### Neigbourhood → District\")\n",
        "qrun(\"\"\"\n",
        "SELECT ?municipality ?district WHERE {\n",
        "  ?m a dbo:Neighbourhood ; schema:name ?municipality ; sc:locatedInDistrict ?d .\n",
        "  OPTIONAL { ?d schema:name ?district }\n",
        "}\n",
        "ORDER BY ?municipality ?district\n",
        "\"\"\", limit=5)\n",
        "\n",
        "print(\"\\n### District → Municipality\")\n",
        "qrun(\"\"\"\n",
        "SELECT ?district ?neighbourhood WHERE {\n",
        "  ?d a dbo:District ; schema:name ?district ; sc:locatedInMunicipality ?n .\n",
        "  OPTIONAL { ?n schema:name ?neighbourhood }\n",
        "}\n",
        "ORDER BY ?district ?neighbourhood\n",
        "\"\"\", limit=5)\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "QWBiOEuUOtoR",
        "outputId": "4ce7cb30-ddc3-426c-fe65-7c915c2b7f25"
      },
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "\n",
            "### Universities → Neighbourhood\n",
            "--- 5 filas ---\n",
            "['Escuela Técnica Superior de Ingenieros de Caminos, Canales y Puertos. Edificio Retiro', 'LOS JERONIMOS']\n",
            "['Escuela Universitaria de Enfermería. Fundación Jiménez Díaz', 'ARGUELLES']\n",
            "['Universidad Complutense de Madrid. Facultad de Informática', 'CIUDAD UNIVERSITARIA']\n",
            "['Centro de Enseñanza Superior en Humanidades y Ciencias de la Educación Don Bosco', 'CIUDAD UNIVERSITARIA']\n",
            "['Residencia Universitaria Tagaste', 'GOYA']\n",
            "\n",
            "### PublicLibraries → Neighbourhood\n",
            "--- 5 filas ---\n",
            "['Biblioteca Pública Municipal Gabriel García Márquez (Usera)', 'ORCASUR']\n",
            "['Biblioteca Pública Municipal Iván de Vargas (Centro)', 'PALACIO']\n",
            "['Biblioteca Pública Municipal Ángel González (Latina)', 'ALUCHE']\n",
            "['Biblioteca Pública Municipal Ciudad Lineal (Ciudad Lineal)', 'PUEBLO NUEVO']\n",
            "['Centro Cultural Paco Rabal. Biblioteca Pública (Puente de Vallecas)', 'PALOMERAS BAJAS']\n",
            "\n",
            "### ParksGardens → Neighbourhood\n",
            "--- 5 filas ---\n",
            "['Parque de Las Cruces', 'BUENAVISTA']\n",
            "['Parque Eugenia de Montijo', 'VISTA ALEGRE']\n",
            "['Parque Mujeres de Orcasitas', 'ORCASITAS']\n",
            "['Parque San José de Calasanz', 'GAZTAMBIDE']\n",
            "['Jardines de Sabatini', 'PALACIO']\n",
            "\n",
            "### SportsCenters → Neighbourhood\n",
            "--- 5 filas ---\n",
            "['Centro Deportivo Municipal Hortaleza', 'APOSTOL SANTIAGO']\n",
            "['Centro Deportivo Municipal Cerro Almodóvar', 'SANTA EUGENIA']\n",
            "['Centro Deportivo Municipal Fuente del Berro', 'FUENTE DEL BERRO']\n",
            "['Centro Deportivo Municipal Vallecas Verano', 'PALOMERAS BAJAS']\n",
            "['Centro Deportivo Municipal Alfredo Goyeneche', 'ARAVACA']\n"
          ]
        }
      ],
      "source": [
        "################################################################################################################\n",
        "# ✅  Comprobar que distintas facilities, parques, sportscenter ... estan asociadas a su → Barrio\n",
        "################################################################################################################\n",
        "\n",
        "for subtype,label in [\n",
        "    (\"sc:EducationalInstitution\",\"Universities\"),\n",
        "    (\"sc:Library\",\"PublicLibraries\"),\n",
        "    (\"sc:Park\",\"ParksGardens\"),\n",
        "    (\"sc:SportsFacility\",\"SportsCenters\")\n",
        "]:\n",
        "    print(f\"\\n### {label} → Neighbourhood\")\n",
        "    qrun(f\"\"\"\n",
        "SELECT ?facility ?neighbourhood WHERE {{\n",
        "  ?f a {subtype} ; schema:containedInPlace ?n .\n",
        "  ?n a dbo:Neighbourhood .\n",
        "  OPTIONAL {{ ?f schema:name ?fraw }}\n",
        "  OPTIONAL {{ ?n schema:name ?nraw }}\n",
        "BIND(COALESCE(?fraw, REPLACE(REPLACE(STR(?f), '^.*/', ''), '%20', ' ')) AS ?facility)\n",
        "BIND(COALESCE(?nraw, REPLACE(REPLACE(STR(?n), '^.*/', ''), '%20', ' ')) AS ?neighbourhood)\n",
        "}}\n",
        "LIMIT 5\n",
        "\"\"\", limit=5)\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {},
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "\n",
            "### Facilities → Neighbourhood\n",
            "--- 5 filas ---\n",
            "['Parque de la Amistad', 'LOS ROSALES']\n",
            "['Parque Eva Duarte', 'GUINDALERA']\n",
            "['Jardines de la Plaza de Chamberí', 'ALMAGRO']\n",
            "['Parque Sancho Dávila', 'FUENTE DEL BERRO']\n",
            "['Jardín del Maestro Padilla', 'IMPERIAL']\n"
          ]
        }
      ],
      "source": [
        "# 🧭 Comprobar relaciones subclases de Facility → Barrio\n",
        "# - Para cada subclase: lista 5 (Facility, Barrio) por containedInPlace\n",
        "\n",
        "for subtype,label in [\n",
        "    (\"sc:Facility\",\"Facilities\")\n",
        "]:\n",
        "    print(f\"\\n### {label} → Neighbourhood\")\n",
        "    qrun(f\"\"\"\n",
        "SELECT ?facility ?neighbourhood WHERE {{\n",
        "  ?f a {subtype} ; schema:containedInPlace ?n .\n",
        "  ?n a dbo:Neighbourhood .\n",
        "  OPTIONAL {{ ?f schema:name ?fraw }}\n",
        "  OPTIONAL {{ ?n schema:name ?nraw }}\n",
        "BIND(COALESCE(?fraw, REPLACE(REPLACE(STR(?f), '^.*/', ''), '%20', ' ')) AS ?facility)\n",
        "BIND(COALESCE(?nraw, REPLACE(REPLACE(STR(?n), '^.*/', ''), '%20', ' ')) AS ?neighbourhood)\n",
        "}}\n",
        "LIMIT 5\n",
        "\"\"\", limit=5)"
      ]
    }
  ],
  "metadata": {
    "colab": {
      "provenance": []
    },
    "kernelspec": {
      "display_name": "Python 3",
      "name": "python3"
    },
    "language_info": {
      "codemirror_mode": {
        "name": "ipython",
        "version": 3
      },
      "file_extension": ".py",
      "mimetype": "text/x-python",
      "name": "python",
      "nbconvert_exporter": "python",
      "pygments_lexer": "ipython3",
      "version": "3.12.6"
    }
  },
  "nbformat": 4,
  "nbformat_minor": 0
}
